cf/InformationRegisters/БуферОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>БуферОбмена</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/БуферОбмена/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Процедура РегистрацияНаСервере()
	
	Отбор = Новый Структура;
	Отбор.Вставить("Пользователь", Пользователи.ТекущийПользователь());
	Выборка = РегистрыСведений.БуферОбмена.Выбрать(Отбор);
	НаборЗаписей = РегистрыСведений.БуферОбмена.СоздатьНаборЗаписей();
	
	Пока Выборка.Следующий() Цикл
		ПланыОбмена.Обмен_МДМ_УПП.ВыполнитьРегистрациюДляУПП(Выборка.Объект, Истина);
		НаборЗаписей.Отбор.Объект.Установить(Выборка.Объект);
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Регистрация(Команда)
	РегистрацияНаСервере();
	Оповестить("ОбновитьБуферОбмена");
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновитьБуферОбмена" Тогда
		Элементы.Список.Обновить();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьОтборПоПользователю();
КонецПроцедуры

Процедура УстановитьОтборПоПользователю()

	Если Список.Отбор.Элементы.Количество() Тогда
		Отбор = Список.Отбор.Элементы[0];
	Иначе
		Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ЛевоеЗначение = Список.Отбор.ДоступныеПоляОтбора.Элементы.Найти("Пользователь").Поле;
	КонецЕсли; 
	Отбор.ПравоеЗначение = Пользователи.ТекущийПользователь();

КонецПроцедуры // 	УстановитьОтборПоВладельцу()
